Ac6Embedded/svd-microchip/PIC32CX_BZ3/WBZ350_SL3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>NVIC</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Nested Vectored Interrupt Controller</description>
         <baseAddress>0xE000E100</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xE04</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>ISER[%s]</name>
               <description>Interrupt Set Enable Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>Interrupt set enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>ICER[%s]</name>
               <description>Interrupt Clear Enable Register</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>Interrupt clear-enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>ISPR[%s]</name>
               <description>Interrupt Set Pending Register</description>
               <addressOffset>0x100</addressOffset>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>Interrupt set-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>ICPR[%s]</name>
               <description>Interrupt Clear Pending Register</description>
               <addressOffset>0x180</addressOffset>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>Interrupt clear-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>IABR[%s]</name>
               <description>Interrupt Active Bit Register</description>
               <addressOffset>0x200</addressOffset>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>Interrupt active bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>43</dim>
               <dimIncrement>1</dimIncrement>
               <name>IP[%s]</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x300</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI0</name>
                     <description>Priority of interrupt n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STIR</name>
               <description>Software Trigger Interrupt Register</description>
               <addressOffset>0xE00</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>INTID</name>
                     <description>Interrupt ID to trigger</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>NVM</name>
         <version>031401.0</version>
         <description>flash controller</description>
         <baseAddress>0x44000600</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>NVM</name>
            <description>Non-Volatile Memory</description>
            <value>3</value>
         </interrupt>
         <registers>
            <register>
               <name>NVMCON</name>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>NVMOP</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LVDERR</name>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERR</name>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WREN</name>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR</name>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMCONCLR</name>
               <addressOffset>0x04</addressOffset>
            </register>
            <register>
               <name>NVMCONSET</name>
               <addressOffset>0x08</addressOffset>
            </register>
            <register>
               <name>NVMCONINV</name>
               <addressOffset>0x0C</addressOffset>
            </register>
            <register>
               <name>NVMCON2</name>
               <addressOffset>0x10</addressOffset>
               <resetValue>0x011F4000</resetValue>
               <fields>
                  <field>
                     <name>NVMPREPG</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RETRY</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>VREAD1</name>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CREAD1</name>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEMP</name>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SLEEP</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERS</name>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMCON2CLR</name>
               <addressOffset>0x14</addressOffset>
            </register>
            <register>
               <name>NVMCON2SET</name>
               <addressOffset>0x18</addressOffset>
            </register>
            <register>
               <name>NVMCON2INV</name>
               <addressOffset>0x1C</addressOffset>
            </register>
            <register>
               <name>NVMKEY</name>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>NVMKEY</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMADDR</name>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>NVMADDR</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMDATA0</name>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>NVMDATA0</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMDATA1</name>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>NVMDATA1</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMDATA2</name>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>NVMDATA2</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMDATA3</name>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>NVMDATA3</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMSRCADDR</name>
               <addressOffset>0xc0</addressOffset>
               <fields>
                  <field>
                     <name>NVMSRCADDR</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMPWPLT</name>
               <addressOffset>0xd0</addressOffset>
               <fields>
                  <field>
                     <name>PWPLT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>ULOCK</name>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMPWPLTCLR</name>
               <addressOffset>0xd4</addressOffset>
            </register>
            <register>
               <name>NVMPWPLTSET</name>
               <addressOffset>0xd8</addressOffset>
            </register>
            <register>
               <name>NVMPWPLTINV</name>
               <addressOffset>0xdC</addressOffset>
            </register>
            <register>
               <name>NVMPWPGTE</name>
               <addressOffset>0xe0</addressOffset>
               <resetValue>0x80FFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PWPGTE</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>ULOCK</name>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMPWPGTECLR</name>
               <addressOffset>0xe4</addressOffset>
            </register>
            <register>
               <name>NVMPWPGTESET</name>
               <addressOffset>0xe8</addressOffset>
            </register>
            <register>
               <name>NVMPWPGTEINV</name>
               <addressOffset>0xeC</addressOffset>
            </register>
            <register>
               <name>NVMLBWP</name>
               <addressOffset>0xf0</addressOffset>
               <resetValue>0x80FFFFFF</resetValue>
               <fields>
                  <field>
                     <name>LBWP0</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP1</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP2</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP11</name>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP12</name>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP13</name>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP14</name>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP15</name>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP16</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP17</name>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP18</name>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP19</name>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP20</name>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP21</name>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP22</name>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBWP23</name>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULOCK</name>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVMLBWPCLR</name>
               <addressOffset>0xf4</addressOffset>
            </register>
            <register>
               <name>NVMLBWPSET</name>
               <addressOffset>0xf8</addressOffset>
            </register>
            <register>
               <name>NVMLBWPINV</name>
               <addressOffset>0xfC</addressOffset>
            </register>
